<script setup lang="ts">
const faq_items = ref([
  {
    title: "نحوه عضویت در باشگاه و دریافت اعتبار خرید چگونه است؟",
    description:
      "افراد یا اشخاص حقیقی نمی توانند به صورت مستقیم عضو باشگاه مشتریان مینی پی شوند. برای استفاده از سرویس اقساطی، سازمان های طرف قرارداد با باشگاه مشتریان مینی پی، اعضای خودشون رو معرفی می کنند و میزان اعتبار آنها را مشخص می کنند. مینی پی صرفا یک زیرساخت خرید اعتباری است که با انعقاد قراداد بین سازمان ها و فروشگاه، تجربه یک خرید اقساطی ساده و سریع رو برای اعضای سازمان ها فراهم میکنه.",
  },
  {
    title: "چطوری اعتبار باقیمانده یا سوابق خریدم رو ببینم؟",
    description:
      "افراد یا اشخاص حقیقی نمی توانند به صورت مستقیم عضو باشگاه مشتریان مینی پی شوند. برای استفاده از سرویس اقساطی، سازمان های طرف قرارداد با باشگاه مشتریان مینی پی، اعضای خودشون رو معرفی می کنند و میزان اعتبار آنها را مشخص می کنند. مینی پی صرفا یک زیرساخت خرید اعتباری است که با انعقاد قراداد بین سازمان ها و فروشگاه، تجربه یک خرید اقساطی ساده و سریع رو برای اعضای سازمان ها فراهم میکنه.",
  },
  {
    title: "فرایند خرید از فروشگاه های حضوری طرف قرارداد چگونه است؟",
    description:
      "افراد یا اشخاص حقیقی نمی توانند به صورت مستقیم عضو باشگاه مشتریان مینی پی شوند. برای استفاده از سرویس اقساطی، سازمان های طرف قرارداد با باشگاه مشتریان مینی پی، اعضای خودشون رو معرفی می کنند و میزان اعتبار آنها را مشخص می کنند. مینی پی صرفا یک زیرساخت خرید اعتباری است که با انعقاد قراداد بین سازمان ها و فروشگاه، تجربه یک خرید اقساطی ساده و سریع رو برای اعضای سازمان ها فراهم میکنه.",
  },
  {
    title: "چطوری از فروشگاه های آنلاین خرید کنم؟",
    description:
      "افراد یا اشخاص حقیقی نمی توانند به صورت مستقیم عضو باشگاه مشتریان مینی پی شوند. برای استفاده از سرویس اقساطی، سازمان های طرف قرارداد با باشگاه مشتریان مینی پی، اعضای خودشون رو معرفی می کنند و میزان اعتبار آنها را مشخص می کنند. مینی پی صرفا یک زیرساخت خرید اعتباری است که با انعقاد قراداد بین سازمان ها و فروشگاه، تجربه یک خرید اقساطی ساده و سریع رو برای اعضای سازمان ها فراهم میکنه.",
  },
  {
    title: "آیا برای دریافت اعتبار باید ضامن داشته باشم؟",
    description:
      "افراد یا اشخاص حقیقی نمی توانند به صورت مستقیم عضو باشگاه مشتریان مینی پی شوند. برای استفاده از سرویس اقساطی، سازمان های طرف قرارداد با باشگاه مشتریان مینی پی، اعضای خودشون رو معرفی می کنند و میزان اعتبار آنها را مشخص می کنند. مینی پی صرفا یک زیرساخت خرید اعتباری است که با انعقاد قراداد بین سازمان ها و فروشگاه، تجربه یک خرید اقساطی ساده و سریع رو برای اعضای سازمان ها فراهم میکنه.",
  },
]);
</script>

<template>
  <div
    class="flex flex-col gap-4 lg:gap-14 px-4 py-8 lg:p-20 rounded-4xl bg-white"
  >
    <div class="flex flex-col items-center gap-2">
      <span class="text-xl text-black font-bold"> سوال‌های پرتکرار شما </span>
      <span class="text-base text-gray-500 font-normal">
        پاسخ به سوال‌هایی که احتمالا براتون پیش بیاد...
      </span>
    </div>
    <Accordion class="space-y-4" type="single" collapsible>
      <AccordionItem
        class="border-0"
        :value="`item-${index}`"
        v-for="(item, index) in faq_items"
        :key="index"
      >
        <AccordionTrigger
          class="items-center text-sm md:text-lg font-medium p-6 rounded-[20px] bg-gray-100 [&[data-state=open]_.faq-icon-plus]:hidden [&[data-state=open]_.faq-icon-minus]:block"
        >
          {{ item.title }}
          <div
            class="flex justify-center items-center rounded-lg size-8 bg-white"
            slot="icon"
          >
            <Icon
              class="faq-icon-plus fill-cyan-400 size-6"
              name="icon:ic-add-line"
            />
            <Icon
              class="faq-icon-minus hidden fill-cyan-400 size-6"
              name="icon:ic-minus-line"
            />
          </div>
        </AccordionTrigger>
        <AccordionContent
          class="text-sm md:text-lg text-gray-500 font-normal p-4"
        >
          {{ item.description }}
        </AccordionContent>
      </AccordionItem>
    </Accordion>
  </div>
</template>

<style lang="css"></style>
