<script setup lang="ts">
const faq_items = ref([
  {
    title: "طرح فارا چیست و به چه کسانی تعلق می‌گیرد؟",
    description:
      "طرح فارا یک سیستم اعتبار خرید اقساطی است که مخصوص مستمری‌بگیران سازمان تأمین اجتماعی که حقوق خود را از بانک رفاه دریافت می‌کنند، طراحی شده است. شرط اصلی بهره‌مندی از طرح، گذشت حداقل ۶ ماه از زمان دریافت اولین مستمری است.",
  },
  {
    title: "سقف اعتبار من چقدر است و چگونه محاسبه می‌شود؟",
    description:
      "اعتبار شما بر اساس ۳۳٪ (یک‌سوم) خالص حقوق دریافتی‌تان محاسبه می‌شود. سقف این اعتبار برای هر فرد حداکثر ۱۵ میلیون تومان در ماه است. - مثال: اگر حقوق شما ۱۰ میلیون تومان باشد، اعتبار ماهانه شما ۳ میلیون و ۳۰۰ هزار تومان خواهد بود.",
  },
  {
    title: "آیا برای استفاده از این اعتبار باید ضامن یا چک بدهم؟",
    description:
      "خیر؛ این طرح نیاز به هیچ‌گونه ضامن، چک یا سفته ندارد. اعتبار شما بر اساس سوابق واریز حقوق شما در بانک رفاه به‌صورت خودکار تخصیص داده می‌شود.",
  },
  {
    title: "کارمزد و سود خرید اقساطی در طرح فارا چقدر است؟",
    description:
      "خودِ طرح فارا دارای کارمزد صفر است و مبلغی به خرید شما اضافه نمی‌کند. با این حال، برخی فروشگاه‌ها ممکن است بر اساس سیاست‌های خود، درصد اندکی کارمزد برای فروش اقساطی لحاظ کنند. حتماً پیش از نهایی کردن خرید، به مبلغ نهایی فاکتور دقت فرمایید.",
  },
  {
    title: "چطور می‌توانم از اعتبارم استفاده کنم؟",
    description:
      "- خرید حضوری: به فروشگاه‌های طرف قرارداد مراجعه کرده و به صندوق‌دار اعلام کنید که از «طرح فارا» استفاده می‌کنید. با ارائه کدملی و وارد کردن رمز پیامکی که برایتان ارسال می‌شود، خرید انجام می‌گردد. - خرید آنلاین: در درگاه پرداخت فروشگاه‌های اینترنتی طرف قرارداد، گزینه «پرداخت با فارا» را انتخاب کنید.",
  },
  {
    title: "اقساط خرید چگونه پرداخت می‌شود؟",
    description:
      "اقساط به‌صورت خودکار از حساب بانک رفاه شما (که حقوق به آن واریز می‌شود) کسر می‌گردد. همچنین می‌توانید قبل از موعد کسر از حقوق، از طریق اپلیکیشن یا وب‌سایت فارا، قسط خود را به‌صورت دستی پرداخت کنید.",
  },
  {
    title: "زمان‌بندی کسر اقساط از حقوق به چه صورت است؟",
    description:
      "دوره‌های مالی فارا از پانزدهم هر ماه تا پانزدهم ماه بعد است: - اگر در نیمه اول دوره (مثلاً ۱ تا ۱۵ فروردین) خرید کنید، اولین قسط در پایان همان ماه کسر می‌شود. - اگر در نیمه دوم دوره (مثلاً ۱۶ تا ۳۰ فروردین) خرید کنید، اولین قسط در پایان ماه بعد (اردیبهشت) کسر خواهد شد.",
  },
  {
    title:
      "چرا با وجود کسر مبلغ از حساب، وضعیت قسط در اپلیکیشن هنوز «ارسال به بانک» است؟",
    description:
      "نتایج وصول اقساط از طرف بانک معمولاً بین دهم تا پانزدهم هر ماه در سیستم فارا ثبت می‌شود. بنابراین بلافاصله پس از برداشت از حساب، وضعیت قسط تغییر نمی‌کند. لطفاً تا زمان به‌روزرسانی سیستم صبور باشید.",
  },
  {
    title: "اگر چندین خرید مختلف انجام دهم، اقساط تجمیع می‌شوند؟",
    description:
      "خیر؛ هر خرید شما یک فاکتور مجزا دارد و اقساط آن به تفکیک محاسبه می‌شود. به عنوان مثال اگر ۵ بار خرید کنید، در صورت‌حساب بانکی شما نیز ۵ مبلغ جداگانه کسر خواهد شد.",
  },
  {
    title: "اگر شماره حساب حقوق من تغییر کرد چه کاری انجام دهم؟",
    description:
      "در صورتی که حساب دریافت حقوق شما در بانک رفاه تغییر کرد، باید مدارک حساب جدید (که حقوق به آن واریز می‌شود) را برای پشتیبانی فارا ارسال کنید تا اطلاعات شما در سامانه به‌روزرسانی شود.",
  },
  {
    title: "چطور لیست فروشگاه‌ها و مانده اعتبارم را ببینم؟",
    description:
      "کافیست اپلیکیشن فاراپی را نصب کرده یا به نسخه وب وارد شوید. در پنل کاربری، تمام جزئیات شامل مانده اعتبار، لیست فروشگاه‌های اطراف، تاریخ اقساط و سوابق خرید برای شما قابل مشاهده است.",
  },
  {
    title:
      "اگر بخواهم شماره موبایلی که «رمز خرید» به آن ارسال می‌شود را تغییر دهم، چه باید بکنم؟",
    description:
      "برای تغییر شماره تماس، نیازی به مراجعه حضوری نیست. کافی است با شماره قبلی خود وارد اپلیکیشن فاراپی یا نسخه وب شوید؛ در بخش تنظیمات حساب کاربری یا پروفایل، امکان ویرایش و ثبت شماره موبایل جدید وجود دارد. از آن پس، تمامی پیامک‌های اطلاع‌رسانی و «رمز خرید» به شماره جدید شما ارسال خواهد شد.",
  },
]);
</script>

<template>
  <div
    class="flex flex-col gap-4 lg:gap-14 px-4 py-8 lg:p-20 rounded-4xl bg-white"
  >
    <div class="flex flex-col items-center gap-2">
      <span class="text-xl text-black font-bold"> سوال‌های پرتکرار شما </span>
      <span class="text-base text-gray-500 font-normal">
        پاسخ به سوال‌هایی که احتمالا براتون پیش بیاد...
      </span>
    </div>
    <Accordion class="space-y-4" type="single" collapsible>
      <AccordionItem
        class="border-0"
        :value="`item-${index}`"
        v-for="(item, index) in faq_items"
        :key="index"
      >
        <AccordionTrigger
          class="items-center text-sm md:text-lg font-medium p-6 rounded-[20px] bg-gray-100 [&[data-state=open]_.faq-icon-plus]:hidden [&[data-state=open]_.faq-icon-minus]:block"
        >
          {{ item.title }}
          <div
            class="flex justify-center items-center rounded-lg size-8 bg-white"
            slot="icon"
          >
            <Icon
              class="faq-icon-plus fill-cyan-400 size-6"
              name="icon:ic-add-line"
            />
            <Icon
              class="faq-icon-minus hidden fill-cyan-400 size-6"
              name="icon:ic-minus-line"
            />
          </div>
        </AccordionTrigger>
        <AccordionContent
          class="text-sm md:text-lg text-gray-500 font-normal p-4"
        >
          {{ item.description }}
        </AccordionContent>
      </AccordionItem>
    </Accordion>
  </div>
</template>

<style lang="css"></style>
