<script setup lang="ts">
const faq_items = ref([
  {
    title: "طرح مهر گستر چیست و چه کسانی می‌توانند از آن استفاده کنند؟",
    description:
      "طرح مهر گستر یک تسهیلات خرید اعتباری بدون کارمزد از طرف سازمان تامین اجتماعی است. تمامی کارمندان شاغل سازمان تامین اجتماعی و شرکت‌های تابعه، بازنشستگان و مستمری‌بگیران این سازمان می‌توانند در این طرح مشارکت کنند.",
  },
  {
    title: "آیا برای استفاده از این طرح نیاز به معرفی ضامن یا چک دارم؟",
    description:
      "خیر. بزرگترین مزیت طرح مهر گستر، حذف کامل ضامن و چک است. اعتبار شما بر اساس حقوق دریافتی‌تان از تامین اجتماعی محاسبه می‌شود و اقساط مستقیماً از حقوق ماه بعد شما کسر خواهد شد.",
  },
  {
    title: "سقف اعتبار خرید من چقدر است؟",
    description:
      "معادل ۴۰ درصد از حقوق ماهیانه شما به عنوان اعتبار خرید تعلق می‌گیرد. یعنی اگر حقوق شما ۱۰ میلیون تومان باشد، می‌توانید تا سقف ۴ میلیون تومان در ماه خرید اعتباری داشته باشید. در خریدهای دو قسطه از فروشگاه‌های طرف قرارداد، این سقف تا ۸ میلیون تومان افزایش می‌یابد.",
  },
  {
    title: "اولین قدم برای فعال‌سازی طرح مهر گستر چیست؟",
    description:
      "ابتدا باید عضو باشگاه مشتریان سازمان تامین اجتماعی شوید. این عضویت از دو روش ساده زیر امکان‌پذیر است: - روش پیامکی: کد ملی خود را به سرشماره 10007651 پیامک کنید. پس از دریافت رمز فعال‌سازی از سرشماره تامین اجتماعی، همان رمز را دوباره به 10007651 ارسال نمایید. - روش اپلیکیشن: اپلیکیشن مینی پی را نصب کنید، گزینه 'تامین اجتماعی' و سپس 'فعال‌سازی' را بزنید. رمز پیامک شده را در برنامه وارد کنید.",
  },
  {
    title: "آیا برای خرید از این اعتبار باید کارمزد یا سودی پرداخت کنم؟",
    description:
      "خود طرح مهر گستر صفر درصد کارمزد دارد و مبلغی بابت سود از حقوق شما کسر نمی‌شود. توجه داشته باشید: ممکن است برخی فروشگاه‌های خصوصی (به‌ویژه فروشندگان کالاهای بادوام) درصدی را به عنوان کارمزد فروش اقساطی از شما دریافت کنند که این مبلغ ارتباطی به سازمان تامین اجتماعی ندارد.",
  },
  {
    title: "دقیقاً چه مبلغی و در چه تاریخی از حقوقم کم می‌شود؟",
    description:
      "هر دوره خرید از ۱۵ ام هر ماه شروع شده و تا ۱۵ ام ماه بعد ادامه دارد. خریدهایی که در این بازه یک‌ماهه (مثلاً ۱۵ فروردین تا ۱۵ اردیبهشت) انجام می‌دهید، در پایان حقوق ماه بعد (در این مثال حقوق آخر اردیبهشت) کسر خواهد شد. دوره جدید خرید نیز از ۱۶ ام ماه آغاز می‌شود.",
  },
  {
    title: "اگر بخواهم یک کالای گران‌تر بخرم، امکانش هست؟",
    description:
      "بله. کافی است به فروشگاه‌هایی مراجعه کنید که تعدا اقساط بالاتری دارند دارند. در این صورت می‌توانید (معادل تعداد اقساط فروشگاه ضربدر اعتبار ماهیانه) خرید کنید که مبلغ آن طی همان تعداد اقساط به صورت مساوی از حقوق متوالی شما کسر خواهد شد.",
  },
  {
    title: "از کجا بفهمم کدام فروشگاه‌ها با این طرح قرارداد دارند؟",
    description:
      "لیست کامل فروشگاه‌های طرف قرارداد به تفکیک صنف و منطقه در اپلیکیشن مینی پی و همچنین وبسایت رسمی باشگاه مشتریان تامین اجتماعی به‌روزرسانی شده و قابل مشاهده است.",
  },
  {
    title: "شماره موبایل من تغییر کرده و رمز خرید به شماره قبلی می‌رود چه کنم؟",
    description:
      "برای تغییر شماره موبایل دریافت‌کننده رمز خرید یا کد فعال‌سازی، باید وارد سامانه 'تامین من' شوید. پس از ورود با اطلاعات هویتی، گزینه 'تغییر شماره' را انتخاب کرده و شماره جدید خود را ثبت نمایید.",
  },
  {
    title: "آیا می‌توانم از اعتبار خودم برای خرید دیگران استفاده کنم؟",
    description:
      "اعتبار تخصیص‌یافته فقط متعلق به شخص بیمه‌شده (کارمند یا بازنشسته) است و خرید باید با حضور شخص بیمه‌شده و ارائه کارت ملی و شماره موبایل ثبت‌شده در باشگاه مشتریان انجام شود.",
  },
]);
</script>

<template>
  <div
    class="flex flex-col gap-4 lg:gap-14 px-4 py-8 lg:p-20 rounded-4xl bg-white"
  >
    <div class="flex flex-col items-center gap-2">
      <span class="text-xl text-black font-bold"> سوال‌های پرتکرار شما </span>
      <span class="text-base text-gray-500 font-normal">
        پاسخ به سوال‌هایی که احتمالا براتون پیش بیاد...
      </span>
    </div>
    <Accordion class="space-y-4" type="single" collapsible>
      <AccordionItem
        class="border-0"
        :value="`item-${index}`"
        v-for="(item, index) in faq_items"
        :key="index"
      >
        <AccordionTrigger
          class="items-center text-sm md:text-lg font-medium p-6 rounded-[20px] bg-gray-100 [&[data-state=open]_.faq-icon-plus]:hidden [&[data-state=open]_.faq-icon-minus]:block"
        >
          <span class="text-right">
            {{ item.title }}
          </span>
          <div
            class="flex justify-center items-center rounded-lg size-8 bg-white"
            slot="icon"
          >
            <Icon
              class="faq-icon-plus fill-cyan-400 size-6"
              name="icon:ic-add-line"
            />
            <Icon
              class="faq-icon-minus hidden fill-cyan-400 size-6"
              name="icon:ic-minus-line"
            />
          </div>
        </AccordionTrigger>
        <AccordionContent
          class="text-sm md:text-lg text-gray-500 font-normal p-4"
        >
          {{ item.description }}
        </AccordionContent>
      </AccordionItem>
    </Accordion>
  </div>
</template>

<style lang="css"></style>
